#include <stdio.h>
#include <math.h>
//3. Да се предложи алгоритъм за намиране броя на цифрите на реално число. Какви проблеми
//възникват?3. Да се предложи алгоритъм за намиране броя на цифрите на реално число. Какви проблеми
//възникват?
//Ако сте на Linux може да възникнат проблеми при използването на библиотеката <math.h>
//отидете на терминала(или сменете да се компилира на bash), влезте в проекта до папка src и напишете 
//cc -lm main.c
//после
//./a.out
//Когато направите промени по кода трябва да повторите същата процедура
int main()
{
	double num = 7.33333;
	int digits;
	
	for(digits = 1; num < ceil(num) ; num*=10, digits++ );
	printf("digits are: %d\n", digits);
	return (0);
}